<a href="https://colab.research.google.com/github/MSR806/iBHubs_AI/blob/main/Pandas/4.%20Pandas_Modifying_DataFrames_and_Series_Part_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd
import numpy as np

# Downloading and Loading Datasets
Downloading all the required csv files and loading the data into the dataframes

In [3]:
# eCommerce Dataset
!wget https://nkb-backend-otg-media-static.s3.ap-south-1.amazonaws.com/otg_prod/media/Tech_4.0/AI_ML/Datasets/shopping_data_v2.csv

shopping_df = pd.read_csv('shopping_data_v2.csv')

--2021-01-05 10:10:40--  https://nkb-backend-otg-media-static.s3.ap-south-1.amazonaws.com/otg_prod/media/Tech_4.0/AI_ML/Datasets/shopping_data_v2.csv
Resolving nkb-backend-otg-media-static.s3.ap-south-1.amazonaws.com (nkb-backend-otg-media-static.s3.ap-south-1.amazonaws.com)... 52.219.64.95
Connecting to nkb-backend-otg-media-static.s3.ap-south-1.amazonaws.com (nkb-backend-otg-media-static.s3.ap-south-1.amazonaws.com)|52.219.64.95|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 16278053 (16M) [text/csv]
Saving to: ‘shopping_data_v2.csv’

shopping_data_v2.cs 100%[===================>]  15.52M  5.54MB/s    in 2.8s

2021-01-05 10:10:44 (5.54 MB/s) - ‘shopping_data_v2.csv’ saved [16278053/16278053]

In [58]:
# Covid Dataset
!wget https://nkb-backend-otg-media-static.s3.ap-south-1.amazonaws.com/otg_prod/media/Tech_4.0/AI_ML/Datasets/italy-covid-daywise.csv

covid_df = pd.read_csv('italy-covid-daywise.csv')

--2021-01-05 10:35:19--  https://nkb-backend-otg-media-static.s3.ap-south-1.amazonaws.com/otg_prod/media/Tech_4.0/AI_ML/Datasets/italy-covid-daywise.csv
Resolving nkb-backend-otg-media-static.s3.ap-south-1.amazonaws.com (nkb-backend-otg-media-static.s3.ap-south-1.amazonaws.com)... 52.219.62.115
Connecting to nkb-backend-otg-media-static.s3.ap-south-1.amazonaws.com (nkb-backend-otg-media-static.s3.ap-south-1.amazonaws.com)|52.219.62.115|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 6619 (6.5K) [text/csv]
Saving to: ‘italy-covid-daywise.csv’

italy-covid-daywise 100%[===================>]   6.46K  --.-KB/s    in 0s

2021-01-05 10:35:20 (207 MB/s) - ‘italy-covid-daywise.csv’ saved [6619/6619]

In [ ]:
# Stackoverflow Survey Dataset
!wget https://nkb-backend-otg-media-static.s3.ap-south-1.amazonaws.com/otg_prod/media/Tech_4.0/AI_ML/Datasets/survey_results_public.csv

survey_df = pd.read_csv('survey_results_public.csv')

In [41]:
# Film Dataset
!wget https://nkb-backend-otg-media-static.s3.ap-south-1.amazonaws.com/otg_prod/media/Tech_4.0/AI_ML/Datasets/film.csv

films_df = pd.read_csv('film.csv')

--2021-01-05 10:28:26--  https://nkb-backend-otg-media-static.s3.ap-south-1.amazonaws.com/otg_prod/media/Tech_4.0/AI_ML/Datasets/film.csv
Resolving nkb-backend-otg-media-static.s3.ap-south-1.amazonaws.com (nkb-backend-otg-media-static.s3.ap-south-1.amazonaws.com)... 52.219.62.91
Connecting to nkb-backend-otg-media-static.s3.ap-south-1.amazonaws.com (nkb-backend-otg-media-static.s3.ap-south-1.amazonaws.com)|52.219.62.91|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 102889 (100K) [text/csv]
Saving to: ‘film.csv’

film.csv            100%[===================>] 100.48K   207KB/s    in 0.5s

2021-01-05 10:28:28 (207 KB/s) - ‘film.csv’ saved [102889/102889]

In [5]:
people = {
    "first": ["Kristen", 'Maxine', 'John'], 
    "last": ["Carol", 'Willians', 'Smith'], 
    "email": ["KristenC@gmail.com", 'Maxine.Williams@email.com', 'JohnSmith@email.com']
}

people_df = pd.DataFrame(people)

# Add/Delete Columns

**We can create a new column by assigning a `Series` as shown below**

In [6]:
shopping_df.head()

   Order ID  ...                      Purchase Address
0    176558  ...          917 1st St, Dallas, TX 75001
1    176559  ...     682 Chestnut St, Boston, MA 02215
2    176560  ...  669 Spruce St, Los Angeles, CA 90001
3    176560  ...  669 Spruce St, Los Angeles, CA 90001
4    176561  ...     333 8th St, Los Angeles, CA 90001

[5 rows x 6 columns]

In [7]:
pd.Series(['Amazon', 'Flipkart', 'Walmart'])

0      Amazon
1    Flipkart
2     Walmart
dtype: object

In [9]:
shopping_df['Store'] = pd.Series(['Amazon', 'Flipkart', 'Walmart'])
shopping_df.head()

   Order ID  ...     Store
0    176558  ...    Amazon
1    176559  ...  Flipkart
2    176560  ...   Walmart
3    176560  ...       NaN
4    176561  ...       NaN

[5 rows x 7 columns]

**Creating a new `Series` and adding it to a `DataFrame`**

In [10]:
people_df.head()

     first      last                      email
0  Kristen     Carol         KristenC@gmail.com
1   Maxine  Willians  Maxine.Williams@email.com
2     John     Smith        JohnSmith@email.com

In [11]:
(people_df['first'] + ' ' + people_df['last'])

0      Kristen Carol
1    Maxine Willians
2         John Smith
dtype: object

In [12]:
people_df['full_name'] = (people_df['first'] + ' ' + people_df['last'])
people_df

     first      last                      email        full_name
0  Kristen     Carol         KristenC@gmail.com    Kristen Carol
1   Maxine  Willians  Maxine.Williams@email.com  Maxine Willians
2     John     Smith        JohnSmith@email.com       John Smith

### Splitting columns

In [13]:
people = {
    "full_name": ["Jack Smith", 'Jane Lodge', 'John Doe', 'Kristen Carol'], 
    "email": ["JackSmith@gmail.com", 'JaneLodge@email.com', 'JohnDoe@email.com', 'KristenC@email.com']
}

people_df = pd.DataFrame(people)
people_df

       full_name                email
0     Jack Smith  JackSmith@gmail.com
1     Jane Lodge  JaneLodge@email.com
2       John Doe    JohnDoe@email.com
3  Kristen Carol   KristenC@email.com

In [14]:
people_df['full_name'].str.split(' ')

0       [Jack, Smith]
1       [Jane, Lodge]
2         [John, Doe]
3    [Kristen, Carol]
Name: full_name, dtype: object

In [15]:
people_df['full_name'].str.split(' ', expand=True)

         0      1
0     Jack  Smith
1     Jane  Lodge
2     John    Doe
3  Kristen  Carol

In [16]:
people_df[['first', 'last']] = people_df['full_name'].str.split(' ', expand=True)
people_df

       full_name                email    first   last
0     Jack Smith  JackSmith@gmail.com     Jack  Smith
1     Jane Lodge  JaneLodge@email.com     Jane  Lodge
2       John Doe    JohnDoe@email.com     John    Doe
3  Kristen Carol   KristenC@email.com  Kristen  Carol

### pd.concat
* `pd.concat(objs, axis=0, ignore_index=False, keys=None)`
  * Concatenates pandas objects along a particular axis
  *   `objs` is a sequence or mapping of Series or DataFrame objects
  *  The `axis` to concatenate along.
  * If `ignore_index` is True, then it does not use the index values along the concatenation axis. The resulting axis will be labeled 0, …, n - 1.

In [17]:
people_df

       full_name                email    first   last
0     Jack Smith  JackSmith@gmail.com     Jack  Smith
1     Jane Lodge  JaneLodge@email.com     Jane  Lodge
2       John Doe    JohnDoe@email.com     John    Doe
3  Kristen Carol   KristenC@email.com  Kristen  Carol

In [18]:
age_and_hobbies = {
    "age": [35, 17, 21, 45], 
    "hobbies": ["painting", 'football', 'running', 'fishing']
}

age_and_hobbies_df = pd.DataFrame(age_and_hobbies)
age_and_hobbies_df

   age   hobbies
0   35  painting
1   17  football
2   21   running
3   45   fishing

In [19]:
pd.concat([people_df, age_and_hobbies_df], axis="columns")

       full_name                email    first   last  age   hobbies
0     Jack Smith  JackSmith@gmail.com     Jack  Smith   35  painting
1     Jane Lodge  JaneLodge@email.com     Jane  Lodge   17  football
2       John Doe    JohnDoe@email.com     John    Doe   21   running
3  Kristen Carol   KristenC@email.com  Kristen  Carol   45   fishing

**We can also concatenate 2 `series` objects**

In [20]:
name = np.array(['Alexis', 'Jonathan'])
gender = np.array(['Female', 'Male'])

name_series = pd.Series(name)
gender_series = pd.Series(gender)

In [21]:
user_df = pd.concat([name_series, gender_series], axis=1)
user_df

          0       1
0    Alexis  Female
1  Jonathan    Male

**You can also create column names using the `keys` option**

In [22]:
user_df = pd.concat([name_series, gender_series], axis=1, keys=['name', 'gender'])
user_df

       name  gender
0    Alexis  Female
1  Jonathan    Male

### pd.DataFrame.drop
* `pd.DataFrame.drop(labels=None, axis=0, index=None, columns=None, inplace=False)`
  * `labels` is the index or column labels to drop.
  *  `axis` specifies the axis to drop the labels from. 
  * `index` is an alternative to specifying the axis (labels, axis=0 is equivalent to index=labels)
  * `columns` is an alternative to specifying the axis (labels, axis=1 is equivalent to columns=labels).

In [23]:
shopping_df.head()

   Order ID  ...     Store
0    176558  ...    Amazon
1    176559  ...  Flipkart
2    176560  ...   Walmart
3    176560  ...       NaN
4    176561  ...       NaN

[5 rows x 7 columns]

In [24]:
shopping_df.drop(columns=['Quantity Ordered', 'Purchase Address', 'Store'], inplace=True)

In [25]:
shopping_df.head()

   Order ID                     Product  Price Each      Order Date
0    176558        USB-C Charging Cable       11.95  04/19/19 08:46
1    176559  Bose SoundSport Headphones       99.99  04/07/19 22:30
2    176560                Google Phone      600.00  04/12/19 14:38
3    176560            Wired Headphones       11.99  04/12/19 14:38
4    176561            Wired Headphones       11.99  04/30/19 09:27

In [26]:
# Alternate way of deleting columns
shopping_df.drop(labels='Order Date', axis='columns')

        Order ID                     Product  Price Each
0         176558        USB-C Charging Cable       11.95
1         176559  Bose SoundSport Headphones       99.99
2         176560                Google Phone      600.00
3         176560            Wired Headphones       11.99
4         176561            Wired Headphones       11.99
...          ...                         ...         ...
185945    176554    Lightning Charging Cable       14.95
185946    176555            27in FHD Monitor      149.99
185947    176556      AAA Batteries (4-pack)        2.99
185948    176557                      iPhone      700.00
185949    176557    Lightning Charging Cable       14.95

[185950 rows x 3 columns]

# Add/Delete Rows

### pd.DataFrame.append
* `pd.DataFrame.append(other, ignore_index=False, sort=False)`
  * Columns in `other` that are not in the dataframe are added as new columns.
  *   If `ignore_index` is True, the resulting axis will be labeled 0, 1, …, n - 1.
  *  If `sort` is True, then it will sort the columns.

In [27]:
people = {
    "first": ["Jack", 'Jane', 'John', 'Kristen'], 
    "last": ["Smith", 'Lodge', 'Doe', 'Carol'], 
    "email": ["JackSmith@gmail.com", 'JaneLodge@email.com', 'JohnDoe@email.com', 'KristenC@email.com']
}

people_df = pd.DataFrame(people)
people_df

     first   last                email
0     Jack  Smith  JackSmith@gmail.com
1     Jane  Lodge  JaneLodge@email.com
2     John    Doe    JohnDoe@email.com
3  Kristen  Carol   KristenC@email.com

The following line of code throws an error, because we didn't assign an index to the new row.

In [28]:
people_df.append({'first':'Justin', 'last':'Timberlake', 'email': 'Justin.T@gmail.com'})

TypeError: ignored

**If `ignore_index` is set to `True`, the row will be indexed automatically.**

In [29]:
people_df.append({'first':'Justin', 'last':'Timberlake', 'email': 'Justin.T@gmail.com'}, ignore_index=True)

     first        last                email
0     Jack       Smith  JackSmith@gmail.com
1     Jane       Lodge  JaneLodge@email.com
2     John         Doe    JohnDoe@email.com
3  Kristen       Carol   KristenC@email.com
4   Justin  Timberlake   Justin.T@gmail.com

**We can append a dataframe too**

In [30]:
people = {
    "first": ["Katy", 'Thomas'], 
    "last" : ["Chap", "Rogers"],
    "email": ["KatyChap@gmail.com", 'ThomasRogers@email.com']
}

people_df_2 = pd.DataFrame(people)
people_df_2

    first    last                   email
0    Katy    Chap      KatyChap@gmail.com
1  Thomas  Rogers  ThomasRogers@email.com

In [31]:
people_df.append(people_df_2, ignore_index=True)

     first    last                   email
0     Jack   Smith     JackSmith@gmail.com
1     Jane   Lodge     JaneLodge@email.com
2     John     Doe       JohnDoe@email.com
3  Kristen   Carol      KristenC@email.com
4     Katy    Chap      KatyChap@gmail.com
5   Thomas  Rogers  ThomasRogers@email.com

In [32]:
people_df.append(people_df_2, ignore_index=True, sort=True)

                    email    first    last
0     JackSmith@gmail.com     Jack   Smith
1     JaneLodge@email.com     Jane   Lodge
2       JohnDoe@email.com     John     Doe
3      KristenC@email.com  Kristen   Carol
4      KatyChap@gmail.com     Katy    Chap
5  ThomasRogers@email.com   Thomas  Rogers

## pd.DataFrame.drop

In [33]:
shopping_df.head()

   Order ID                     Product  Price Each      Order Date
0    176558        USB-C Charging Cable       11.95  04/19/19 08:46
1    176559  Bose SoundSport Headphones       99.99  04/07/19 22:30
2    176560                Google Phone      600.00  04/12/19 14:38
3    176560            Wired Headphones       11.99  04/12/19 14:38
4    176561            Wired Headphones       11.99  04/30/19 09:27

In [34]:
shopping_df.drop(index=[1, 2])

        Order ID                     Product  Price Each      Order Date
0         176558        USB-C Charging Cable       11.95  04/19/19 08:46
3         176560            Wired Headphones       11.99  04/12/19 14:38
4         176561            Wired Headphones       11.99  04/30/19 09:27
5         176562        USB-C Charging Cable       11.95  04/29/19 13:03
6         176563  Bose SoundSport Headphones       99.99  04/02/19 07:46
...          ...                         ...         ...             ...
185945    176554    Lightning Charging Cable       14.95  03/24/19 11:14
185946    176555            27in FHD Monitor      149.99  03/22/19 20:27
185947    176556      AAA Batteries (4-pack)        2.99  03/14/19 10:29
185948    176557                      iPhone      700.00  03/30/19 12:32
185949    176557    Lightning Charging Cable       14.95  03/30/19 12:32

[185948 rows x 4 columns]

In [35]:
shopping_df.drop(labels=[4, 3], axis="index")

        Order ID                     Product  Price Each      Order Date
0         176558        USB-C Charging Cable       11.95  04/19/19 08:46
1         176559  Bose SoundSport Headphones       99.99  04/07/19 22:30
2         176560                Google Phone      600.00  04/12/19 14:38
5         176562        USB-C Charging Cable       11.95  04/29/19 13:03
6         176563  Bose SoundSport Headphones       99.99  04/02/19 07:46
...          ...                         ...         ...             ...
185945    176554    Lightning Charging Cable       14.95  03/24/19 11:14
185946    176555            27in FHD Monitor      149.99  03/22/19 20:27
185947    176556      AAA Batteries (4-pack)        2.99  03/14/19 10:29
185948    176557                      iPhone      700.00  03/30/19 12:32
185949    176557    Lightning Charging Cable       14.95  03/30/19 12:32

[185948 rows x 4 columns]

We can use drop with Series' too.

In [36]:
shopping_df['Product'].drop(labels=[1,2])

0               USB-C Charging Cable
3                   Wired Headphones
4                   Wired Headphones
5               USB-C Charging Cable
6         Bose SoundSport Headphones
                     ...
185945      Lightning Charging Cable
185946              27in FHD Monitor
185947        AAA Batteries (4-pack)
185948                        iPhone
185949      Lightning Charging Cable
Name: Product, Length: 185948, dtype: object

# Merge DataFrames

**`pd.DataFrame.merge(right, on=None)`**
  * Returns a DataFrame of the two merged objects.
  * `right` is the object to merge with
  * `on`: the columns to join on. It must be in both the dataframe objects.

**Similar to the SQL JOIN operation**

In [37]:
people = {
    "full_name": ["Rama Rao", 'Kuldeep Yadav'], 
    "email": ["ramarao@gmail.com", 'kuldeepy@email.com'],
    "place" : ["Hyderabad", "Lucknow"]
}

df1 = pd.DataFrame(people)
df1

       full_name               email      place
0       Rama Rao   ramarao@gmail.com  Hyderabad
1  Kuldeep Yadav  kuldeepy@email.com    Lucknow

In [38]:
location = {
    "place" : ["Hyderabad", "Lucknow"],
    "state" : ["Telangana", "Uttar Pradesh"]
}

df2 = pd.DataFrame(location)
df2

       place          state
0  Hyderabad      Telangana
1    Lucknow  Uttar Pradesh

In [39]:
df1.merge(df2, on="place")

       full_name               email      place          state
0       Rama Rao   ramarao@gmail.com  Hyderabad      Telangana
1  Kuldeep Yadav  kuldeepy@email.com    Lucknow  Uttar Pradesh

In [40]:
pd.DataFrame.merge?

#Sorting

### pd.DataFrame.sort_values

* `pd.DataFrame.sort_values(by, axis=0, ascending=True, inplace=False,  ignore_index=False)`
  * Sort by the values along either axis.
  * `by` is the name or list of names to sort by.
  * `axis`is the axis to be sorted
  * If `ignore_index` is True, then the resulting axis will be labeled 0, 1, …, n - 1.

In [42]:
films_df.head()

   Year  Length                    Title  ...           Director Popularity Awards
0  1990     111  Tie Me Up! Tie Me Down!  ...   Almodóvar, Pedro         68     No
1  1991     113               High Heels  ...   Almodóvar, Pedro         68     No
2  1983     104           Dead Zone, The  ...  Cronenberg, David         79     No
3  1979     122                     Cuba  ...    Lester, Richard          6     No
4  1978      94           Days of Heaven  ...   Malick, Terrence         14     No

[5 rows x 9 columns]

In [43]:
films_df.sort_values(by='Year')

      Year  Length  ... Popularity Awards
922   1924      95  ...         74     No
54    1924     110  ...         79     No
405   1925     125  ...         73     No
65    1926      66  ...         76     No
62    1926     126  ...         55     No
...    ...     ...  ...        ...    ...
348   1992     108  ...         80     No
382   1992      85  ...         26     No
800   1993      95  ...         53     No
72    1996      96  ...         39     No
1062  1997     109  ...         60     No

[1128 rows x 9 columns]

In [44]:
films_df.sort_values(by='Popularity', ascending=False)

      Year  Length                    Title  ...         Director Popularity Awards
830   1990      95        Dangerous Pursuit  ...    Stern, Sandor         88     No
1106  1991     160          Great Race, The  ...   Edwards, Blake         88     No
409   1989      86              Let It Ride  ...       Pytka, Joe         88     No
976   1985     161            Out of Africa  ...  Pollack, Sydney         88    Yes
536   1989      90           New Year's Day  ...    Jaglom, Henry         88     No
...    ...     ...                      ...  ...              ...        ...    ...
825   1990      89  A Chorus of Disapproval  ...  Winner, Michael          0     No
84    1968     113                  Shalako  ...  Dmytryk, Edward          0     No
479   1987      85    Hot Child in the City  ...     Florea, John          0     No
785   1983      72      After the Rehearsal  ...  Bergman, Ingmar          0     No
160   1970     137                  Airport  ...   Seaton, George          0    Yes

[1128 rows x 9 columns]

In [45]:
pd.DataFrame.sort_values?

In [46]:
films_df.sort_values(by='Popularity', ascending=False, ignore_index=True)

      Year  Length                    Title  ...         Director Popularity Awards
0     1990      95        Dangerous Pursuit  ...    Stern, Sandor         88     No
1     1991     160          Great Race, The  ...   Edwards, Blake         88     No
2     1989      86              Let It Ride  ...       Pytka, Joe         88     No
3     1985     161            Out of Africa  ...  Pollack, Sydney         88    Yes
4     1989      90           New Year's Day  ...    Jaglom, Henry         88     No
...    ...     ...                      ...  ...              ...        ...    ...
1123  1990      89  A Chorus of Disapproval  ...  Winner, Michael          0     No
1124  1968     113                  Shalako  ...  Dmytryk, Edward          0     No
1125  1987      85    Hot Child in the City  ...     Florea, John          0     No
1126  1983      72      After the Rehearsal  ...  Bergman, Ingmar          0     No
1127  1970     137                  Airport  ...   Seaton, George          0    Yes

[1128 rows x 9 columns]

In [47]:
films_df.sort_values(by=['Year', 'Popularity'], ascending=[True, False])

      Year  Length  ... Popularity Awards
54    1924     110  ...         79     No
922   1924      95  ...         74     No
405   1925     125  ...         73     No
65    1926      66  ...         76     No
394   1926     109  ...         72     No
...    ...     ...  ...        ...    ...
873   1992      96  ...          5     No
49    1992      95  ...          3     No
800   1993      95  ...         53     No
72    1996      96  ...         39     No
1062  1997     109  ...         60     No

[1128 rows x 9 columns]

In [49]:
films_df.sort_values(by=['Popularity', 'Year'], ascending=[True, True])

      Year  Length                Title  ...         Director Popularity Awards
393   1930      92        Anna Christie  ...  Brown, Clarence          0     No
84    1968     113              Shalako  ...  Dmytryk, Edward          0     No
160   1970     137              Airport  ...   Seaton, George          0    Yes
802   1976     128   Shout at the Devil  ...   Hunt, Peter R.          0     No
240   1980      91         It's My Turn  ...   Weill, Claudia          0     No
...    ...     ...                  ...  ...              ...        ...    ...
536   1989      90       New Year's Day  ...    Jaglom, Henry         88     No
117   1990     105  Guilty by Suspicion  ...   Winkler, Irwin         88     No
830   1990      95    Dangerous Pursuit  ...    Stern, Sandor         88     No
153   1991      91            Raw Nerve  ...  Prior, David A.         88     No
1106  1991     160      Great Race, The  ...   Edwards, Blake         88     No

[1128 rows x 9 columns]

We can use `sort_values` with Series' too.

In [50]:
films_df['Length'].sort_values(ascending=False)

354    450
917    360
822    360
212    313
446    298
      ...
592     54
427     51
202     50
198     40
273     18
Name: Length, Length: 1128, dtype: int64

### NLargest and NSmallest

**nlargest** returns the first n rows ordered by columns in descending order.

In [53]:
films_df['Length']

0       111
1       113
2       104
3       122
4        94
       ...
1123     93
1124     90
1125    103
1126     87
1127     92
Name: Length, Length: 1128, dtype: int64

In [54]:
films_df['Length'].nlargest(10)

354     450
822     360
917     360
212     313
446     298
47      286
502     265
998     243
735     240
1008    234
Name: Length, dtype: int64

In [55]:
films_df.nlargest(15, ['Popularity', 'Length'])

      Year  Length  ... Popularity Awards
976   1985     161  ...         88    Yes
1106  1991     160  ...         88     No
565   1970     130  ...         88     No
904   1982     128  ...         88     No
117   1990     105  ...         88     No
759   1940     105  ...         88     No
858   1986     104  ...         88     No
728   1960     103  ...         88     No
830   1990      95  ...         88     No
153   1991      91  ...         88     No
142   1935      90  ...         88     No
536   1989      90  ...         88     No
924   1986      90  ...         88     No
27    1989      88  ...         88     No
409   1989      86  ...         88     No

[15 rows x 9 columns]

**nsmallest** returns the first n rows ordered by columns in ascending order.

In [56]:
films_df['Year'].nsmallest(5)

54     1924
922    1924
405    1925
62     1926
65     1926
Name: Year, dtype: int64

In [57]:
films_df.nsmallest(5, 'Length')

     Year  Length  ... Popularity Awards
273  1942      18  ...         75     No
198  1954      40  ...         62     No
202  1983      50  ...         28     No
427  1964      51  ...         27     No
592  1935      54  ...         50     No

[5 rows x 9 columns]

# Try It Yourself

For the following questions, use the **Covid** dataset.

0.  Load the dataset into a dataframe using `read_csv`
1.  Add a row to the dataset, containing stats for September 5th.
2.  Sort the dataset in ascending order of `date` and descending order of `new_cases`. 
3. Get the top 15 days with the largest number of new_cases.
4. Drop the `new_deaths` and `new_tests` columns of the dataset.
5. Drop the first 5 rows of the dataset.

### 0.  Load the dataset into a dataframe using `read_csv`

In [59]:
covid_df = pd.read_csv('italy-covid-daywise.csv')

In [60]:
covid_df.head()

         date  new_cases  new_deaths  new_tests
0  2019-12-31        0.0         0.0        NaN
1  2020-01-01        0.0         0.0        NaN
2  2020-01-02        0.0         0.0        NaN
3  2020-01-03        0.0         0.0        NaN
4  2020-01-04        0.0         0.0        NaN

### 1.  Add a row to the dataset, containing stats for September 5th.

In [62]:
covid_df.append({'date': '2020-09-05', 'new_cases':0.0, 'new_deaths':0.0, 'new_tests':np.nan}, ignore_index= True)

           date  new_cases  new_deaths  new_tests
0    2019-12-31        0.0         0.0        NaN
1    2020-01-01        0.0         0.0        NaN
2    2020-01-02        0.0         0.0        NaN
3    2020-01-03        0.0         0.0        NaN
4    2020-01-04        0.0         0.0        NaN
..          ...        ...         ...        ...
244  2020-08-31     1365.0         4.0    42583.0
245  2020-09-01      996.0         6.0    54395.0
246  2020-09-02      975.0         8.0        NaN
247  2020-09-03     1326.0         6.0        NaN
248  2020-09-05        0.0         0.0        NaN

[249 rows x 4 columns]

### 2.  Sort the dataset in ascending order of `date` and descending order of `new_cases`.

In [63]:
covid_df.sort_values(['date', 'new_cases'], ascending= False)

           date  new_cases  new_deaths  new_tests
247  2020-09-03     1326.0         6.0        NaN
246  2020-09-02      975.0         8.0        NaN
245  2020-09-01      996.0         6.0    54395.0
244  2020-08-31     1365.0         4.0    42583.0
243  2020-08-30     1444.0         1.0    53541.0
..          ...        ...         ...        ...
4    2020-01-04        0.0         0.0        NaN
3    2020-01-03        0.0         0.0        NaN
2    2020-01-02        0.0         0.0        NaN
1    2020-01-01        0.0         0.0        NaN
0    2019-12-31        0.0         0.0        NaN

[248 rows x 4 columns]

### 3. Get the top 15 days with the largest number of new_cases.

In [65]:
covid_df.nlargest(15, 'new_cases')

           date  new_cases  new_deaths  new_tests
82   2020-03-22     6557.0       795.0        NaN
87   2020-03-27     6153.0       660.0        NaN
81   2020-03-21     5986.0       625.0        NaN
89   2020-03-29     5974.0       887.0        NaN
88   2020-03-28     5959.0       971.0        NaN
83   2020-03-23     5560.0       649.0        NaN
80   2020-03-20     5322.0       429.0        NaN
85   2020-03-25     5249.0       743.0        NaN
90   2020-03-30     5217.0       758.0        NaN
86   2020-03-26     5210.0       685.0        NaN
96   2020-04-05     4805.0       681.0        NaN
84   2020-03-24     4789.0       601.0        NaN
93   2020-04-02     4782.0       727.0        NaN
103  2020-04-12     4694.0       619.0        NaN
94   2020-04-03     4668.0       760.0        NaN

### 4. Drop the `new_deaths` and `new_tests` columns of the dataset.

In [67]:
covid_df.drop(['new_deaths', 'new_tests'], axis=1)

           date  new_cases
0    2019-12-31        0.0
1    2020-01-01        0.0
2    2020-01-02        0.0
3    2020-01-03        0.0
4    2020-01-04        0.0
..          ...        ...
243  2020-08-30     1444.0
244  2020-08-31     1365.0
245  2020-09-01      996.0
246  2020-09-02      975.0
247  2020-09-03     1326.0

[248 rows x 2 columns]

### 5. Drop the first 5 rows of the dataset.

In [68]:
covid_df.drop(labels=[0,1,2,3,4], axis=0)

           date  new_cases  new_deaths  new_tests
5    2020-01-05        0.0         0.0        NaN
6    2020-01-06        0.0         0.0        NaN
7    2020-01-07        0.0         0.0        NaN
8    2020-01-08        0.0         0.0        NaN
9    2020-01-09        0.0         0.0        NaN
..          ...        ...         ...        ...
243  2020-08-30     1444.0         1.0    53541.0
244  2020-08-31     1365.0         4.0    42583.0
245  2020-09-01      996.0         6.0    54395.0
246  2020-09-02      975.0         8.0        NaN
247  2020-09-03     1326.0         6.0        NaN

[243 rows x 4 columns]